<template>
  <section class="values">
    <article class="value__block">
      <div class="value__text">
        <h2>我们的使命</h2>
        <p>保障白血病患儿教育权利和改善患儿教育现况</p>
      </div>
      <div class="value__image">
        <svg
          xmlns="http://www.w3.org/2000/svg"
          xmlns:xlink="http://www.w3.org/1999/xlink"
          height="15rem"
          width="15rem"
          version="1.1"
          id="Layer_1"
          viewBox="0 0 507.9 507.9"
          xml:space="preserve"
        >
          <g>
            <path
              style="fill: #40596b"
              d="M254,0c-3.1,0-5.6,2.5-5.6,5.6v30.5c0,3.1,2.5,5.6,5.6,5.6s5.6-2.5,5.6-5.6V5.6   C259.6,2.5,257.1,0,254,0z"
            />
            <path
              style="fill: #40596b"
              d="M254,466.2c-3.1,0-5.6,2.5-5.6,5.6v30.5c0,3.1,2.5,5.6,5.6,5.6s5.6-2.5,5.6-5.6v-30.5   C259.6,468.7,257.1,466.2,254,466.2z"
            />
            <path
              style="fill: #40596b"
              d="M156.8,19.3c-2.9,1.2-4.2,4.5-3.1,7.4l11.7,28.2c1.2,2.9,4.5,4.2,7.4,3.1c2.9-1.2,4.2-4.5,3.1-7.4   l-11.7-28.2C163,19.5,159.7,18.1,156.8,19.3z"
            />
            <path
              style="fill: #40596b"
              d="M335.2,450.1c-2.9,1.2-4.2,4.5-3.1,7.4l11.7,28.2c1.2,2.9,4.5,4.2,7.4,3.1c2.9-1.2,4.2-4.5,3.1-7.4   l-11.7-28.2C341.4,450.2,338.1,448.9,335.2,450.1z"
            />
            <path
              style="fill: #40596b"
              d="M74.4,74.4c-2.2,2.2-2.2,5.8,0,8L96,103.9c2.2,2.2,5.8,2.2,8,0s2.2-5.8,0-8L82.4,74.4   C80.2,72.2,76.6,72.2,74.4,74.4z"
            />
            <path
              style="fill: #40596b"
              d="M404.1,404.1c-2.2,2.2-2.2,5.8,0,8l21.6,21.6c2.2,2.2,5.8,2.2,8,0s2.2-5.8,0-8L412,404.1   C409.8,401.9,406.3,401.9,404.1,404.1z"
            />
            <path
              style="fill: #40596b"
              d="M19.3,156.8c-1.2,2.9,0.2,6.2,3.1,7.4l28.2,11.7c2.9,1.2,6.2-0.2,7.4-3.1c1.2-2.9-0.2-6.2-3.1-7.4   l-28.2-11.7C23.8,152.6,20.5,153.9,19.3,156.8z"
            />
            <path
              style="fill: #40596b"
              d="M450.1,335.2c-1.2,2.9,0.2,6.2,3.1,7.4l28.2,11.7c2.9,1.2,6.2-0.2,7.4-3.1c1.2-2.9-0.2-6.2-3.1-7.4   l-28.2-11.7C454.6,331,451.3,332.3,450.1,335.2z"
            />
            <path
              style="fill: #40596b"
              d="M0,254c0,3.1,2.5,5.6,5.6,5.6h30.5c3.1,0,5.6-2.5,5.6-5.6s-2.5-5.6-5.6-5.6H5.6   C2.5,248.4,0,250.9,0,254z"
            />
            <path
              style="fill: #40596b"
              d="M466.2,254c0,3.1,2.5,5.6,5.6,5.6h30.5c3.1,0,5.6-2.5,5.6-5.6s-2.5-5.6-5.6-5.6h-30.5   C468.7,248.4,466.2,250.9,466.2,254z"
            />
            <path
              style="fill: #40596b"
              d="M19.3,351.2c1.2,2.9,4.5,4.2,7.4,3.1l28.2-11.7c2.9-1.2,4.2-4.5,3.1-7.4c-1.2-2.9-4.5-4.2-7.4-3.1   l-28.2,11.7C19.5,345,18.1,348.3,19.3,351.2z"
            />
            <path
              style="fill: #40596b"
              d="M450.1,172.8c1.2,2.9,4.5,4.2,7.4,3.1l28.2-11.7c2.9-1.2,4.2-4.5,3.1-7.4c-1.2-2.9-4.5-4.2-7.4-3.1   l-28.2,11.7C450.2,166.6,448.9,169.9,450.1,172.8z"
            />
            <path
              style="fill: #40596b"
              d="M74.4,433.6c2.2,2.2,5.8,2.2,8,0L104,412c2.2-2.2,2.2-5.8,0-8s-5.8-2.2-8,0l-21.6,21.6   C72.2,427.8,72.2,431.4,74.4,433.6z"
            />
            <path
              style="fill: #40596b"
              d="M404.1,103.9c2.2,2.2,5.8,2.2,8,0l21.6-21.6c2.2-2.2,2.2-5.8,0-8s-5.8-2.2-8,0L404.1,96   C401.9,98.2,401.9,101.7,404.1,103.9z"
            />
            <path
              style="fill: #40596b"
              d="M156.8,488.7c2.9,1.2,6.2-0.2,7.4-3.1l11.7-28.2c1.2-2.9-0.2-6.2-3.1-7.4c-2.9-1.2-6.2,0.2-7.4,3.1   l-11.7,28.2C152.6,484.2,153.9,487.5,156.8,488.7z"
            />
            <path
              style="fill: #40596b"
              d="M335.2,57.9c2.9,1.2,6.2-0.2,7.4-3.1l11.7-28.2c1.2-2.9-0.2-6.2-3.1-7.4s-6.2,0.2-7.4,3.1   l-11.7,28.2C331,53.4,332.3,56.7,335.2,57.9z"
            />
          </g>
          <path
            style="fill: #ff7058"
            d="M329.2,122c-30.6,0-57.7,14.4-75.2,36.7c-17.5-22.3-44.7-36.7-75.2-36.7c-52.8,0-95.7,42.8-95.7,95.7  c0,90.5,170.9,201.1,170.9,201.1s170.9-109.1,170.9-201.1C424.9,164.9,382.1,122,329.2,122z"
          />
        </svg>
      </div>
    </article>
    <article class="value__block">
      <div class="value__text">
        <h2>我们的愿景</h2>
        <p>建立一个可持续发展的组织</p>
        <p>并致力于推动白血病儿童教育缺失问题的解决</p>
      </div>
      <div class="value__image">
        <svg
          xmlns="http://www.w3.org/2000/svg"
          xmlns:xlink="http://www.w3.org/1999/xlink"
          width="15rem"
          height="15rem"
          viewBox="0 0 128 128"
          aria-hidden="true"
          role="img"
          class="iconify iconify--noto"
          preserveAspectRatio="xMidYMid meet"
        >
          <g fill="#ffc107">
            <path
              d="M36.46 36.81l-14.14-9.06a2.213 2.213 0 0 1-.41-3.45l5.31-5.31c1.02-1.02 2.74-.8 3.47.45l8.84 14.37c1.16 1.98-1.11 4.2-3.07 3z"
            ></path>

            <path
              d="M24.1 80.39l-16.42.33a2.21 2.21 0 0 0-2.09 2.77l1.91 7.26c.37 1.4 1.96 2.07 3.22 1.37l14.51-7.59c2-1.13 1.17-4.19-1.13-4.14z"
            ></path>

            <path
              d="M62.24 108.28l-3.6 15.99c-.33 1.39.72 2.73 2.15 2.73h7.51c1.45 0 2.5-1.37 2.14-2.77l-3.91-15.99c-.58-2.23-3.75-2.2-4.29.04z"
            ></path>

            <path
              d="M91.54 36.81l14.14-9.06c1.22-.75 1.42-2.44.41-3.45l-5.31-5.31a2.212 2.212 0 0 0-3.47.45l-8.84 14.37c-1.16 1.98 1.11 4.2 3.07 3z"
            ></path>

            <path
              d="M103.9 80.39l16.42.33a2.21 2.21 0 0 1 2.09 2.77l-1.91 7.26a2.217 2.217 0 0 1-3.22 1.37l-14.51-7.59c-2-1.13-1.17-4.19 1.13-4.14z"
            ></path>
          </g>

          <path
            d="M68.05 7.23l13.46 30.7a7.047 7.047 0 0 0 5.82 4.19l32.79 2.94c3.71.54 5.19 5.09 2.5 7.71l-24.7 20.75c-2 1.68-2.91 4.32-2.36 6.87l7.18 33.61c.63 3.69-3.24 6.51-6.56 4.76L67.56 102a7.033 7.033 0 0 0-7.12 0l-28.62 16.75c-3.31 1.74-7.19-1.07-6.56-4.76l7.18-33.61c.54-2.55-.36-5.19-2.36-6.87L5.37 52.78c-2.68-2.61-1.2-7.17 2.5-7.71l32.79-2.94a7.047 7.047 0 0 0 5.82-4.19l13.46-30.7c1.67-3.36 6.45-3.36 8.11-.01z"
            fill="#fdd835"
          ></path>

          <path
            d="M67.07 39.77l-2.28-22.62c-.09-1.26-.35-3.42 1.67-3.42c1.6 0 2.47 3.33 2.47 3.33l6.84 18.16c2.58 6.91 1.52 9.28-.97 10.68c-2.86 1.6-7.08.35-7.73-6.13z"
            fill="#ffff8d"
          ></path>

          <path
            d="M95.28 71.51L114.9 56.2c.97-.81 2.72-2.1 1.32-3.57c-1.11-1.16-4.11.51-4.11.51l-17.17 6.71c-5.12 1.77-8.52 4.39-8.82 7.69c-.39 4.4 3.56 7.79 9.16 3.97z"
            fill="#f4b400"
          ></path>
        </svg>
      </div>
    </article>
  </section>
</template>

<script setup></script>

<style scoped>
.values {
  padding-inline: var(--page-padding-inline);
  padding-block: 0 3rem;
}
.value__block {
  /* outline: 3px red solid; */
  display: flex;
  flex-direction: row;
  justify-content: space-between;
  align-items: center;
  margin-bottom: 7rem;
}
.value__block:nth-child(even) {
  flex-direction: row-reverse;
  text-align: right;
}
.value__text h2 {
  display: inline-block;
  font-size: var(--fs-700);
  font-weight: 700;
  font-family: var(--ff-accent);
  margin-bottom: 1rem;
  position: relative;
  text-decoration: wavy underline var(--clr-primary);
  -webkit-text-decoration: wavy underline var(--clr-primary);
  text-underline-offset: 0.3rem;
}
.value__text p {
  font-size: var(--fs-400);
  font-weight: 400;
  font-family: var(--ff-accent);
  line-height: 1.5;
}

@media (max-width: 700px) {
  .values {
    padding-top: 5rem;
  }
  .value__block {
    flex-direction: column;
    margin-bottom: 5rem;
    text-align: center;
    gap: 2rem;
  }
  .value__block:nth-child(even) {
    flex-direction: column;
    text-align: center;
  }
}
</style>
